Tools/mutation/0001-restore-parse-tree-cache.patch
diff --git a/Sources/muterCore/MutationSteps/DiscoverMutationPoints.swift b/Sources/muterCore/MutationSteps/DiscoverMutationPoints.swift
index 3ee6b67..538e5f3 100644
--- a/Sources/muterCore/MutationSteps/DiscoverMutationPoints.swift
+++ b/Sources/muterCore/MutationSteps/DiscoverMutationPoints.swift
@@ -35,9 +35,7 @@ struct DiscoverMutationPoints: MutationStep {
 
         return [
             .mutationMappingsDiscovered(mappings),
-            // Pass empty dictionary - ApplySchemata will re-parse files on demand
-            // This prevents memory exhaustion on large codebases (2000+ files)
-            .sourceCodeParsed([:]),
+            .sourceCodeParsed(discovered.sourceCodeByFilePath),
         ]
     }
 }
@@ -95,6 +93,7 @@ private extension DiscoverMutationPoints {
                         if !schemataMappings.isEmpty {
                             lock.lock()
                             discoveredFiles.mappings.append(contentsOf: schemataMappings)
+                            discoveredFiles.sourceCodeByFilePath[path] = sourceCode.source.code
                             lock.unlock()
                         }
                     }
@@ -144,4 +143,5 @@ private extension DiscoverMutationPoints {
 
 private class DiscoveredFiles {
     var mappings: [SchemataMutationMapping] = []
+    var sourceCodeByFilePath: [FilePath: SourceFileSyntax] = [:]
 }
